Repository: michalprog/clean_path
Catalog: lib/l10n/app_*.arb
Languages: de, es, pl

# drawerOptions
source: Options
de: Optionen
es: Opciones
pl: Opcje

# drawerStatistics
source: Statistics
de: Statistiken
es: Estadísticas
pl: Statystyki

# drawerSettings
source: Settings
de: Einstellungen
es: Ajustes
pl: Ustawienia

# drawerForum
source: Forum
es: Foro

# drawerAchievements
source: Achievements
de: Erfolge
es: Logros
pl: Osiągnięcia

# settingsTitle
source: Settings
de: Einstellungen
es: Ajustes
pl: Ustawienia

# languageSectionTitle
source: Language
de: Sprache
es: Idioma
pl: Język

# appLanguageTitle
source: App language
de: App-Sprache
es: Idioma de la app
pl: Język aplikacji

# appLanguageSubtitle
source: Select your preferred language
de: Wähle deine bevorzugte Sprache
es: Selecciona tu idioma preferido
pl: Wybierz preferowany język

# selectedLanguageLabel
source: Currently selected
de: Aktuelle Sprache
es: Idioma seleccionado
pl: Aktualny język

# achievementsTitle
source: Achievements
de: Erfolge
es: Logros
pl: Osiągnięcia

# achievement1Title
source: Let's get started!
de: Los geht's!
es: ¡Empecemos!
pl: Zaczynamy!

# achievement1Description
source: Begin any fight with an addiction.
de: Beginne einen beliebigen Kampf gegen eine Sucht.
es: Empieza cualquier lucha contra una adicción.
pl: Rozpocznij dowolną walkę z uzależnieniem.

# achievement2Title
source: First day of the journey
de: Erster Tag der Reise
es: Primer día del viaje
pl: Pierwszy dzień podróży

# achievement2Description
source: The first 24 hours are behind you. Every step counts!
de: Die ersten 24 Stunden liegen hinter dir. Jeder Schritt zählt!
es: Las primeras 24 horas ya pasaron. ¡Cada paso cuenta!
pl: Pierwsze 24 godziny za Tobą. Każdy krok się liczy!

# achievement3Title
source: 3 days of freedom
de: 3 Tage Freiheit
es: 3 días de libertad
pl: 3 dni wolności

# achievement3Description
source: Three days of perseverance! You're building your new future.
de: Drei Tage Durchhaltevermögen! Du baust dir deine neue Zukunft.
es: ¡Tres días de perseverancia! Estás construyendo tu nuevo futuro.
pl: Trzy dni wytrwałości! Budujesz swoją nową przyszłość.

# achievement4Title
source: 7 days clean
de: 7 Tage sauber
es: 7 días limpio
pl: 7 dni czystości

# achievement4Description
source: The first week is behind you. You're stronger than you think!
de: Die erste Woche ist vorbei. Du bist stärker, als du denkst!
es: La primera semana quedó atrás. ¡Eres más fuerte de lo que crees!
pl: Pierwszy tydzień za Tobą. Jesteś silniejszy, niż myślisz!

# achievement5Title
source: Two weeks of perseverance
de: Zwei Wochen Durchhaltevermögen
es: Dos semanas de perseverancia
pl: Dwa tygodnie wytrwałości

# achievement5Description
source: Two weeks on the new path already. You can be proud!
de: Bereits zwei Wochen auf dem neuen Weg. Du kannst stolz sein!
es: Ya son dos semanas en el nuevo camino. ¡Puedes estar orgulloso!
pl: Już dwa tygodnie na nowej drodze. Możesz być dumny!

# achievement6Title
source: A month of new life
de: Ein Monat neues Leben
es: Un mes de nueva vida
pl: Miesiąc nowego życia

# achievement6Description
source: 30 days of change! Your determination makes a difference.
de: 30 Tage Veränderung! Deine Entschlossenheit macht den Unterschied.
es: ¡30 días de cambio! Tu determinación marca la diferencia.
pl: 30 dni zmiany! Twoja determinacja robi różnicę.

# achievement7Title
source: 60 days of strength
de: 60 Tage Stärke
es: 60 días de fuerza
pl: 60 dni siły

# achievement7Description
source: Two months already. Your consistency deserves recognition!
de: Schon zwei Monate. Deine Konsequenz verdient Anerkennung!
es: Ya dos meses. ¡Tu constancia merece reconocimiento!
pl: Już dwa miesiące. Twoja konsekwencja zasługuje na uznanie!

# achievement8Title
source: 100 days of victory
de: 100 Tage Sieg
es: 100 días de victoria
pl: 100 dni zwycięstwa

# achievement8Description
source: Over three months now. Perseverance is becoming your strength!
de: Über drei Monate jetzt. Ausdauer wird zu deiner Stärke!
es: Más de tres meses. ¡La perseverancia se está convirtiendo en tu fuerza!
pl: To już ponad trzy miesiące. Wytrwałość staje się Twoją siłą!

# achievement9Title
source: Year of freedom
de: Jahr der Freiheit
es: Año de libertad
pl: Rok wolności

# achievement9Description
source: 365 days of struggle, growth, and transformation. You're an example of strength and determination!
de: 365 Tage Kampf, Wachstum und Transformation. Du bist ein Beispiel für Stärke und Entschlossenheit!
es: 365 días de lucha, crecimiento y transformación. ¡Eres un ejemplo de fuerza y determinación!
pl: 365 dni walki, wzrostu i przemiany. Jesteś przykładem siły i determinacji!

# achievement10Title
source: One minute passed
de: Eine Minute vorbei
es: Pasó un minuto
pl: Minuta minęła

# achievement10Description
source: Test achievement for verification.
de: Test-Erfolg zur Überprüfung.
es: Logro de prueba para verificación.
pl: Testowe osiągnięcie do sprawdzania.

source: No achievements
de: Keine Erfolge
es: Sin logros
pl: Brak osiągnięć

# noRecordsForDay
source: No records for this day
de: Keine Einträge für diesen Tag
es: No hay registros para este día
pl: Brak rekordów na ten dzień

# motivationPopupDescription
source: You can always begin again.\nDon't lose faith in yourself
de: Du kannst jederzeit neu beginnen.\nVerliere nicht den Glauben an dich selbst
es: Siempre puedes empezar de nuevo.\nNo pierdas la fe en ti mismo
pl: Zawsze możesz zacząć od nowa.\nNie trać wiary w siebie

source: Not Now
de: Nicht jetzt
es: Ahora no
pl: Nie teraz

source: Try Again
de: Erneut versuchen
es: Intentar de nuevo
pl: Spróbuj ponownie

# commentLabel
source: Comment
de: Kommentar
es: Comentario
pl: Komentarz

# failDateLabel
source: Fail date
de: Fehldatum
es: Fecha de fallo
pl: Data niepowodzenia

source: Cancel
de: Abbrechen
es: Cancelar
pl: Anuluj

source: Save
de: Speichern
es: Guardar
pl: Zapisz

source: No Records
de: Keine Einträge
es: Sin registros
pl: Brak rekordów

# mainTagline
source: Get rid of addictions with us today!
de: Werde deine Süchte noch heute mit uns los!
es: ¡Libérate de las adicciones con nosotros hoy mismo!
pl: Pozbądź się uzależnień z nami już dziś!

# addictionPornography
source: Pornography
de: Pornografie
es: Pornografía
pl: Pornografia

# addictionSmoking
source: Smoking
de: Rauchen
es: Fumar
pl: Palenie

# addictionDrinking
source: Drinking
de: Alkohol
es: Alcohol
pl: Alkohol

# addictionSweets
source: Sweets
de: Süßes
es: Dulces
pl: Słodycze

# editRecordTitle
source: Edit Record
de: Eintrag bearbeiten
es: Editar registro
pl: Edytuj rekord

# commentHint
source: Write comment...
de: Kommentar schreiben...
es: Escribe un comentario...
pl: Napisz komentarz...

# dateHint
source: Choose date
de: Datum auswählen
es: Elige la fecha
pl: Wybierz datę

# motivationMessage1
source: One day at a time — that's enough.
de: Ein Tag nach dem anderen – das reicht.
es: Un día a la vez; es suficiente.
pl: Dzień po dniu — to wystarczy.

# motivationMessage2
source: You don’t have to be perfect, just persistent.
de: Du musst nicht perfekt sein, nur beharrlich.
es: No tienes que ser perfecto, solo constante.
pl: Nie musisz być doskonały, tylko wytrwały.

# motivationMessage3
source: Every no is a step toward freedom.
de: Jedes Nein ist ein Schritt in Richtung Freiheit.
es: Cada no es un paso hacia la libertad.
pl: Każde nie prowadzi cię do wolności.

# motivationMessage4
source: Your strength is built in silence — keep going.
de: Deine Stärke wächst in der Stille – mach weiter.
es: Tu fuerza se construye en silencio; sigue adelante.
pl: Twoja siła buduje się w ciszy — idź dalej.

# motivationMessage5
source: A setback doesn’t erase your progress. Getting back up proves your power.
de: Ein Rückschlag löscht deinen Fortschritt nicht. Wieder aufzustehen zeigt deine Kraft.
es: Un tropiezo no borra tu progreso. Levantarte demuestra tu poder.
pl: Potknięcie nie kasuje postępów. Podniesienie się dowodzi twojej siły.

# motivationMessage6
source: You are not alone. What you feel matters.
de: Du bist nicht allein. Was du fühlst, zählt.
es: No estás solo. Lo que sientes importa.
pl: Nie jesteś sam. To, co czujesz, ma znaczenie.

# motivationMessage7
source: Your tomorrow depends on the choices you make today.
de: Dein Morgen hängt von den Entscheidungen ab, die du heute triffst.
es: Tu mañana depende de las decisiones que tomes hoy.
pl: Twoje jutro zależy od decyzji, które podejmujesz dziś.

# motivationMessage8
source: Recovery isn’t weakness. It’s a sign of courage.
de: Genesung ist keine Schwäche, sondern ein Zeichen von Mut.
es: La recuperación no es debilidad. Es una muestra de valentía.
pl: Powrót do równowagi to nie słabość, lecz odwaga.

# motivationMessage9
source: Peace in your mind is possible — and it’s worth the fight.
de: Frieden im Kopf ist möglich – und den Kampf wert.
es: La paz en tu mente es posible, y vale la pena lucharla.
pl: Spokój w głowie jest możliwy — i warto o niego walczyć.

# motivationMessage10
source: Every day clean is a victory no one can take from you.
de: Jeder nüchterne Tag ist ein Sieg, den dir niemand nehmen kann.
es: Cada día limpio es una victoria que nadie puede quitarte.
pl: Każdy trzeźwy dzień to zwycięstwo, którego nikt ci nie odbierze.

source: Total attempts
de: Gesamtanzahl der Versuche
es: Intentos totales
pl: Łączna liczba prób

source: Average attempt time
de: Durchschnittliche Versuchsdauer
es: Tiempo medio del intento
pl: Średni czas próby

source: No Fap Status
es: Estado No Fap
pl: Status No Fap

source: No Smoking Status
de: Nichtraucher-Status
es: Estado sin fumar
pl: Status bez palenia

source: No Alcohol Status
de: Ohne Alkohol Status
es: Estado sin alcohol
pl: Status bez alkoholu

source: No Sweet Status
de: Ohne Süßes Status
es: Estado sin dulces
pl: Status bez słodyczy

source: Times of trials
de: Versuchszeiten
es: Veces de intentos
pl: Czas prób

source: Total number of attempts
de: Gesamtzahl der Versuche
es: Número total de intentos
pl: Łączna liczba prób

source: Longest attempt time
de: Längste Versuchsdauer
es: Mayor duración del intento
pl: Najdłuższy czas próby

source: Is attempt active?
de: Ist der Versuch aktiv?
es: ¿Está activo el intento?
pl: Czy próba jest aktywna?

source: Current duration
de: Aktuelle Dauer
es: Duración actual
pl: Aktualny czas

# statusActive
source: active
de: aktiv
es: activo
pl: aktywne

# statusNotActive
source: not active
de: inaktiv
es: inactivo
pl: nieaktywne

# errorWithMessage
source: Error: {message}
de: Fehler: {message}
pl: Błąd: {message}
